#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/MyFirstCluster/cluster]
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-003c3de41c8944776]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-cluster-20220119013503040400000004]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role.this[0]: Refreshing state... [id=memory_optimized_large-eks-node-group-20220119013503033100000001]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=MyFirstCluster-cluster-20220119013503040400000004-2022011901350401940000000a]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=MyFirstCluster-cluster-20220119013503040400000004-20220119013503959700000008]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=memory_optimized_large-eks-node-group-20220119013503033100000001-20220119013504016800000009]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=memory_optimized_large-eks-node-group-20220119013503033100000001-20220119013503785200000007]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=memory_optimized_large-eks-node-group-20220119013503033100000001-20220119013503783400000006]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a5fe513e511b4063]
module.eks.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06db3baf877f4ebdf]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0396487828a1a299b]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-086bcaa7bc4e8740f]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_security_group.this[0]: Refreshing state... [id=sg-0964cd37ad71fd1bc]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f495c8372bb349e4]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c7189c44881a10da]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a7d6b80ace03a82b]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c7189c44881a10da1080289494]
module.eks.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02ff31c3304a331e3]
module.eks.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0512f022719f23363]
module.eks.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-000145358ebe7eefa]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-762021669]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-1442354988]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2898521290]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2735473987]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2737597728]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1150961460]
module.eks.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2317789746]
module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-4035246027]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3771065563]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-728150561]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-2458047239]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2437279620]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-1491117617]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=MyFirstCluster]
module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0]: Refreshing state... [id=lt-08f0f959029ea206c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] has changed
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/MyFirstCluster/cluster"
        name              = "/aws/eks/MyFirstCluster/cluster"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] has changed
  ~ resource "aws_eks_cluster" "this" {
        id                        = "MyFirstCluster"
        name                      = "MyFirstCluster"
      + tags                      = {}
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-cluster-20220119013503040400000004"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "MyFirstCluster-cluster-20220119013503040400000004"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_security_group.cluster[0] has changed
  ~ resource "aws_security_group" "cluster" {
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node groups"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a5fe513e511b4063",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node kubelets"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a5fe513e511b4063",
                ]
              + self             = false
              + to_port          = 10250
            },
        ]
        id                     = "sg-0f495c8372bb349e4"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Node groups to cluster API"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0a5fe513e511b4063",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "MyFirstCluster-cluster-20220119013503038500000002"
        tags                   = {
            "Name" = "MyFirstCluster-cluster"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] has changed
  ~ resource "aws_security_group" "node" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/TCP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/UDP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress all HTTPS to internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Node groups to cluster API"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f495c8372bb349e4",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        id                     = "sg-0a5fe513e511b4063"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node groups"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f495c8372bb349e4",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Cluster API to node kubelets"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f495c8372bb349e4",
                ]
              + self             = false
              + to_port          = 10250
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        name                   = "MyFirstCluster-node-20220119013503041700000005"
        tags                   = {
            "Name"                                 = "MyFirstCluster-node"
            "kubernetes.io/cluster/MyFirstCluster" = "owned"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-2458047239"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-1491117617"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] has changed
  ~ resource "aws_security_group_rule" "cluster" {
      + cidr_blocks              = []
        id                       = "sgrule-2437279620"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-4035246027"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_https"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-2317789746"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-1442354988"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-728150561"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-762021669"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0a5fe513e511b4063"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-2735473987"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0a5fe513e511b4063"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-2898521290"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-2737597728"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-1150961460"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0a5fe513e511b4063"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-3771065563"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0a5fe513e511b4063"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "memory_optimized_large-eks-node-group-20220119013503033100000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "memory_optimized_large-eks-node-group-20220119013503033100000001"
      + tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0] has changed
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-08f0f959029ea206c"
        name                    = "memory_optimized_large-2022011901455226910000000b"
      + security_group_names    = []
      + tags                    = {}
        # (9 unchanged attributes hidden)



        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
          + "r5a.large",
          + "r5ad.large",
          + "r5b.large",
          + "r5n.large",
          + "r4.large",
          + "z1d.large",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "memory_optimized_large-"
      + node_role_arn          = "arn:aws:iam::865518846931:role/memory_optimized_large-eks-node-group-20220119013503033100000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0396487828a1a299b",
          + "subnet-06db3baf877f4ebdf",
          + "subnet-086bcaa7bc4e8740f",
        ]
      + tags                   = {
          + "Name" = "memory_optimized_large"
        }
      + tags_all               = {
          + "Name" = "memory_optimized_large"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = "memory_optimized_large-2022011901455226910000000b"
          + version = "1"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*